#![cfg(not(doctest))]
#![allow(unused)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
/* automatically generated by rust-bindgen 0.71.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 36;

pub const __LITTLE_ENDIAN: u32 = 1234;
pub const __BIG_ENDIAN: u32 = 4321;
pub const __PDP_ENDIAN: u32 = 3412;
pub const _BITS_ENDIANNESS_H: u32 = 1;
pub const __BYTE_ORDER: u32 = 1234;
pub const __FLOAT_WORD_ORDER: u32 = 1234;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const BYTE_ORDER: u32 = 1234;
pub const _BITS_BYTESWAP_H: u32 = 1;
pub const _BITS_UINTN_IDENTITY_H: u32 = 1;
pub const _SYS_SELECT_H: u32 = 1;
pub const __sigset_t_defined: u32 = 1;
pub const __timeval_defined: u32 = 1;
pub const _STRUCT_TIMESPEC: u32 = 1;
pub const FD_SETSIZE: u32 = 1024;
pub const _BITS_PTHREADTYPES_COMMON_H: u32 = 1;
pub const _THREAD_SHARED_TYPES_H: u32 = 1;
pub const _BITS_PTHREADTYPES_ARCH_H: u32 = 1;
pub const __SIZEOF_PTHREAD_MUTEX_T: u32 = 40;
pub const __SIZEOF_PTHREAD_ATTR_T: u32 = 56;
pub const __SIZEOF_PTHREAD_RWLOCK_T: u32 = 56;
pub const __SIZEOF_PTHREAD_BARRIER_T: u32 = 32;
pub const __SIZEOF_PTHREAD_MUTEXATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_COND_T: u32 = 48;
pub const __SIZEOF_PTHREAD_CONDATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_RWLOCKATTR_T: u32 = 8;
pub const __SIZEOF_PTHREAD_BARRIERATTR_T: u32 = 4;
pub const _THREAD_MUTEX_INTERNAL_H: u32 = 1;
pub const __PTHREAD_MUTEX_HAVE_PREV: u32 = 1;
pub const __have_pthread_attr_t: u32 = 1;
pub const _ALLOCA_H: u32 = 1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = " @typedef acSystem;\n\n Representation of the system object, the entry point into Arena SDK."]
pub type acSystem = *mut ::std::os::raw::c_void;
#[doc = " @typedef acSocket;\n\n Representation of the socket object, the entry point into Arena SDK."]
pub type acSocket = *mut ::std::os::raw::c_void;
#[doc = " @typedef acDevice;\n\n Represents a device, used to configure and stream a device."]
pub type acDevice = *mut ::std::os::raw::c_void;
#[doc = " @typedef acBuffer;\n\n Represents a buffer, which carries a payload of either an image or a chunk\n data. A buffer can hold image data and/or chunk data."]
pub type acBuffer = *mut ::std::os::raw::c_void;
#[doc = " @typedef acFeatureStream;\n\n Represents a feature stream object, allowing node map configurations to be\n streamed to and from files."]
pub type acFeatureStream = *mut ::std::os::raw::c_void;
#[doc = " @typedef acNodeMap;\n\n Represents a node map, or feature tree."]
pub type acNodeMap = *mut ::std::os::raw::c_void;
#[doc = " @typedef acNode;\n\n Represents a node, or feature."]
pub type acNode = *mut ::std::os::raw::c_void;
#[doc = " @typedef acCallback;\n\n Represents a callback handle, used to deregister callbacks when they are no\n longer needed."]
pub type acCallback = *mut ::std::os::raw::c_void;
#[doc = " @typedef acFileStreamHandle;\n\n Represents a GenApi Input FileStream"]
pub type acIDevFileStream = *mut ::std::os::raw::c_void;
#[doc = " @typedef acFileStreamHandle;\n\n Represents a GenApi Output FileStream"]
pub type acODevFileStream = *mut ::std::os::raw::c_void;
pub type bool8_t = u8;
#[doc = " @typedef acCallbackFunction\n\n The signature of a function needed to register a callback. An example of\n such a function might look like the following.\n\n \\code{.c}\n \t// a function with the appropriate function signature to register as a callback\n \t// error handling skipped for brevity\n \t{\n \t\tvoid onCallback(acNode hNode, void* pUserData)\n \t\t{\n \t\t\tUserDataStruct* userData = reinterpret_cast<UserDataStruct*>(pUserData);\n\n \t\t\tchar pBuf[100];\n \t\t\tsize_t len = 100;\n \t\t\tacNodeGetName(hNode, pBuf, &len);\n \t\t\t// ...\n \t\t}\n \t}\n \\endcode"]
pub type acCallbackFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: acNode, arg2: *mut ::std::os::raw::c_void)>;
pub type acImageCallbackFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: acBuffer, arg2: *mut ::std::os::raw::c_void)>;
pub type acDeviceDisconnectCallbackFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: acDevice)>;
#[doc = "< Success, no error"]
pub const AC_ERROR_LIST_AC_ERR_SUCCESS: AC_ERROR_LIST = 0;
#[doc = "< Generic error"]
pub const AC_ERROR_LIST_AC_ERR_ERROR: AC_ERROR_LIST = -1001;
#[doc = "< Arena SDK not initialized"]
pub const AC_ERROR_LIST_AC_ERR_NOT_INITIALIZED: AC_ERROR_LIST = -1002;
#[doc = "< Function not implemented"]
pub const AC_ERROR_LIST_AC_ERR_NOT_IMPLEMENTED: AC_ERROR_LIST = -1003;
#[doc = "< Resource already in use"]
pub const AC_ERROR_LIST_AC_ERR_RESOURCE_IN_USE: AC_ERROR_LIST = -1004;
#[doc = "< Incorrect access"]
pub const AC_ERROR_LIST_AC_ERR_ACCESS_DENIED: AC_ERROR_LIST = -1005;
#[doc = "< Null/incorrect handle"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_HANDLE: AC_ERROR_LIST = -1006;
#[doc = "< Incorrect ID"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_ID: AC_ERROR_LIST = -1007;
#[doc = "< No data available"]
pub const AC_ERROR_LIST_AC_ERR_NO_DATA: AC_ERROR_LIST = -1008;
#[doc = "< Null/incorrect parameter"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_PARAMETER: AC_ERROR_LIST = -1009;
#[doc = "< Input/output error"]
pub const AC_ERROR_LIST_AC_ERR_IO: AC_ERROR_LIST = -1010;
#[doc = "< Timed out"]
pub const AC_ERROR_LIST_AC_ERR_TIMEOUT: AC_ERROR_LIST = -1011;
#[doc = "< Function aborted"]
pub const AC_ERROR_LIST_AC_ERR_ABORT: AC_ERROR_LIST = -1012;
#[doc = "< Invalid buffer"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_BUFFER: AC_ERROR_LIST = -1013;
#[doc = "< Function not available"]
pub const AC_ERROR_LIST_AC_ERR_NOT_AVAILABLE: AC_ERROR_LIST = -1014;
#[doc = "< Invalid register address"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_ADDRESS: AC_ERROR_LIST = -1015;
#[doc = "< Buffer too small"]
pub const AC_ERROR_LIST_AC_ERR_BUFFER_TOO_SMALL: AC_ERROR_LIST = -1016;
#[doc = "< Invalid index"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_INDEX: AC_ERROR_LIST = -1017;
#[doc = "< Error parsing chunk data"]
pub const AC_ERROR_LIST_AC_ERR_PARSING_CHUNK_DATA: AC_ERROR_LIST = -1018;
#[doc = "< Invalid value"]
pub const AC_ERROR_LIST_AC_ERR_INVALID_VALUE: AC_ERROR_LIST = -1019;
#[doc = "< Resource cannot perform more actions"]
pub const AC_ERROR_LIST_AC_ERR_RESOURCE_EXHAUSTED: AC_ERROR_LIST = -1020;
#[doc = "< Not enough memory"]
pub const AC_ERROR_LIST_AC_ERR_OUT_OF_MEMORY: AC_ERROR_LIST = -1021;
#[doc = "< Busy on anothe process"]
pub const AC_ERROR_LIST_AC_ERR_BUSY: AC_ERROR_LIST = -1022;
#[doc = "< Start adding custom error LIST here"]
pub const AC_ERROR_LIST_AC_ERR_CUSTOM: AC_ERROR_LIST = -10000;
#[doc = " @enum AC_ERROR_LIST\n\n This enum represents the different errors that a function might return.\n\n @warning\n  - Use AC_ERROR integer values in place of AC_ERROR_LIST enum values"]
pub type AC_ERROR_LIST = ::std::os::raw::c_int;
#[doc = " @typedef AC_ERROR;\n\n Integer representation of the error enum (AC_ERROR_LIST)."]
pub type AC_ERROR = i32;
#[doc = "< Not implemented"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_NI: AC_ACCESS_MODE_LIST = 0;
#[doc = "< Not available"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_NA: AC_ACCESS_MODE_LIST = 1;
#[doc = "< Write only"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_WO: AC_ACCESS_MODE_LIST = 2;
#[doc = "< Read only"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_RO: AC_ACCESS_MODE_LIST = 3;
#[doc = "< Read and write"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_RW: AC_ACCESS_MODE_LIST = 4;
#[doc = "< Undefined"]
pub const AC_ACCESS_MODE_LIST_AC_ACCESS_MODE_UNDEFINED: AC_ACCESS_MODE_LIST = 5;
#[doc = " @enum AC_ACCESS_MODE_LIST\n\n This enum represents the different access modes for a device or its features.\n\n @warning\n  - Use AC_ACCESS_MODE integer values in place of AC_ACCESS_MODE_LIST enum\n    values"]
pub type AC_ACCESS_MODE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_ACCESS_MODE;\n\n Integer representation of the access mode enum (AC_ACCESS_MODE_LIST)."]
pub type AC_ACCESS_MODE = i32;
#[doc = "< Do not use cache"]
pub const AC_CACHING_MODE_LIST_AC_CACHING_MODE_NO_CACHE: AC_CACHING_MODE_LIST = 0;
#[doc = "< Write to cache and register"]
pub const AC_CACHING_MODE_LIST_AC_CACHING_MODE_WRITE_THROUGH: AC_CACHING_MODE_LIST = 1;
#[doc = "< Write to register, write to cache on read"]
pub const AC_CACHING_MODE_LIST_AC_CACHING_MODE_WRITE_AROUND: AC_CACHING_MODE_LIST = 2;
#[doc = "< Undefined"]
pub const AC_CACHING_MODE_LIST_AC_CACHING_MODE_UNDEFINED: AC_CACHING_MODE_LIST = 3;
#[doc = " @enum AC_CACHING_MODE_LIST\n\n This enum represents the different caching modes a node might use.\n\n @warning\n  - Use AC_CACHING_MODE integer values in place of AC_CACHING_MODE_LIST enum\n    values"]
pub type AC_CACHING_MODE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_CACHING_MODE;\n\n Integer representation of the caching mode enum (AC_CACHING_MODE_LIST)."]
pub type AC_CACHING_MODE = i32;
#[doc = "< Name resides in custom namespace"]
pub const AC_NAMESPACE_LIST_AC_NAMESPACE_CUSTOM: AC_NAMESPACE_LIST = 0;
#[doc = "< Name resides in one of the standard namespaces"]
pub const AC_NAMESPACE_LIST_AC_NAMESPACE_STANDARD: AC_NAMESPACE_LIST = 1;
#[doc = "< Undefined"]
pub const AC_NAMESPACE_LIST_AC_NAMESPACE_UNDEFINED: AC_NAMESPACE_LIST = 2;
#[doc = " @enum AC_NAMESPACE_LIST\n\n This enum represents whether a node is in the standard or custom namespaces.\n\n @warning\n  - Use AC_NAMESPACE integer values in place of AC_NAMESPACE_LIST enum values"]
pub type AC_NAMESPACE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_NAMESPACE;\n\n Integer representation of the namespace enum (AC_NAMESPACE_LIST)."]
pub type AC_NAMESPACE = i32;
#[doc = "< IValue interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_VALUE: AC_INTERFACE_TYPE_LIST = 0;
#[doc = "< IBase interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_BASE: AC_INTERFACE_TYPE_LIST = 1;
#[doc = "< IInteger interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_INTEGER: AC_INTERFACE_TYPE_LIST = 2;
#[doc = "< IBoolean interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_BOOLEAN: AC_INTERFACE_TYPE_LIST = 3;
#[doc = "< ICommand interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_COMMAND: AC_INTERFACE_TYPE_LIST = 4;
#[doc = "< IFloat interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_FLOAT: AC_INTERFACE_TYPE_LIST = 5;
#[doc = "< IString interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_STRING: AC_INTERFACE_TYPE_LIST = 6;
#[doc = "< IRegister interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_REGISTER: AC_INTERFACE_TYPE_LIST = 7;
#[doc = "< ICategory interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_CATEGORY: AC_INTERFACE_TYPE_LIST = 8;
#[doc = "< IEnumeration interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_ENUMERATION: AC_INTERFACE_TYPE_LIST = 9;
#[doc = "< IEnumEntry interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_ENUMENTRY: AC_INTERFACE_TYPE_LIST = 10;
#[doc = "< IPort interface"]
pub const AC_INTERFACE_TYPE_LIST_AC_INTERFACE_TYPE_PORT: AC_INTERFACE_TYPE_LIST = 11;
#[doc = " @enum AC_INTERFACE_TYPE_LIST\n\n This enum represents the interface type of a node.\n\n @warning\n  - Use AC_INTERFACE_TYPE integer values in place of AC_INTERFACE_LIST enum\n    values"]
pub type AC_INTERFACE_TYPE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_INTERFACE_TYPE;\n\n Integer representation of the interface type enum (AC_INTERFACE_TYPE_LIST)."]
pub type AC_INTERFACE_TYPE = i32;
#[doc = "< Always visible"]
pub const AC_VISIBILITY_LIST_AC_VISIBILITY_BEGINNER: AC_VISIBILITY_LIST = 0;
#[doc = "< Visible for experts or gurus"]
pub const AC_VISIBILITY_LIST_AC_VISIBILITY_EXPERT: AC_VISIBILITY_LIST = 1;
#[doc = "< Visible for gurus"]
pub const AC_VISIBILITY_LIST_AC_VISIBILITY_GURU: AC_VISIBILITY_LIST = 2;
#[doc = "< Not visible"]
pub const AC_VISIBILITY_LIST_AC_VISIBILITY_INVISIBLE: AC_VISIBILITY_LIST = 3;
#[doc = "< Undefined"]
pub const AC_VISIBILITY_LIST_AC_VISIBILITY_UNDEFINED: AC_VISIBILITY_LIST = 99;
#[doc = " @enum AC_VISIBILITY_LIST\n\n This enum represents the different visibilities of a node.\n\n @warning\n  - Use AC_VISIBILITY integer values in place of AC_VISIBILITY_LIST enum\n    values"]
pub type AC_VISIBILITY_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_VISIBILITY;\n\n Integer representation of the visibility enum (AC_VISIBILITY_LIST)."]
pub type AC_VISIBILITY = i32;
#[doc = "< The feature has no increment"]
pub const AC_INC_MODE_LIST_AC_INC_MODE_NONE: AC_INC_MODE_LIST = 0;
#[doc = "< The feature has a fix increment"]
pub const AC_INC_MODE_LIST_AC_INC_MODE_FIXED: AC_INC_MODE_LIST = 1;
#[doc = "< The feature has a list of valid values"]
pub const AC_INC_MODE_LIST_AC_INC_MODE_LIST: AC_INC_MODE_LIST = 2;
#[doc = " @enum AC_INC_MODE_LIST\n\n This enum represents the different increment modes of an integer/float node.\n\n @warning\n  - Use AC_INC_MODE integer values in place of AC_INC_MODE_LIST enum values"]
pub type AC_INC_MODE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_INC_MODE;\n\n Integer representation of the increment mode enum (AC_INC_MODE_LIST)."]
pub type AC_INC_MODE = i32;
#[doc = "< Slider with linear behavior"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_LINEAR: AC_REPRESENTATION_LIST = 0;
#[doc = "< Slider with logarithmic behavior"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_LOGARITHMIC: AC_REPRESENTATION_LIST = 1;
#[doc = "< Check box"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_BOOLEAN: AC_REPRESENTATION_LIST = 2;
#[doc = "< Decimal number in an edit control"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_PURE_NUMBER: AC_REPRESENTATION_LIST = 3;
#[doc = "< Hex number in an edit control"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_HEX_NUMBER: AC_REPRESENTATION_LIST = 4;
#[doc = "< IP address"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_IPV4_ADDRESS: AC_REPRESENTATION_LIST = 5;
#[doc = "< MAC address"]
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_MAC_ADDRESS: AC_REPRESENTATION_LIST = 6;
pub const AC_REPRESENTATION_LIST_AC_REPRESENTATION_UNDEFINED: AC_REPRESENTATION_LIST = 7;
#[doc = " @enum AC_REPRESENTATION_LIST\n\n This enum represents the different representations of an integer/float node.\n\n @warning\n  - Use AC_REPRESENTATION integer values in place of AC_REPRESENTATION_LIST\n    enum values"]
pub type AC_REPRESENTATION_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_REPRESENTATION;\n\n Integer representation of the numeric representation enum\n (AC_REPRESENTATION_LIST)."]
pub type AC_REPRESENTATION = i32;
#[doc = "< The notation if either scientific or fixed depending on what is shorter"]
pub const AC_DISPLAY_NOTATION_LIST_AC_DISPLAY_NOTATION_AUTOMATIC: AC_DISPLAY_NOTATION_LIST = 0;
#[doc = "< The notation is fixed, e.g. 123.4"]
pub const AC_DISPLAY_NOTATION_LIST_AC_DISPLAY_NOTATION_FIXED: AC_DISPLAY_NOTATION_LIST = 1;
#[doc = "< The notation is scientific, e.g. 1.234e2"]
pub const AC_DISPLAY_NOTATION_LIST_AC_DISPLAY_NOTATION_SCIENTIFIC: AC_DISPLAY_NOTATION_LIST = 2;
#[doc = "< Undefined"]
pub const AC_DISPLAY_NOTATION_LIST_AC_DISPLAY_NOTATION_UNDEFINED: AC_DISPLAY_NOTATION_LIST = 3;
#[doc = " @enum AC_DISPLAY_NOTATION_LIST\n\n This enum represents the best way to display a float node.\n\n @warning\n  - Use AC_DISPLAY_NOTATION integer values in place of\n    AC_DISPLAY_NOTATION_LIST enum values"]
pub type AC_DISPLAY_NOTATION_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_DISPLAY_NOTATION;\n\n Integer representation of the display notation enum\n (AC_DISPLAY_NOTATION_LIST)."]
pub type AC_DISPLAY_NOTATION = i32;
#[doc = "< Image data only"]
pub const AC_PAYLOAD_TYPE_LIST_AC_PAYLOAD_TYPE_IMAGE: AC_PAYLOAD_TYPE_LIST = 1;
#[doc = "< Image data extended with chunk data"]
pub const AC_PAYLOAD_TYPE_LIST_AC_PAYLOAD_TYPE_IMAGE_EXTENDED_CHUNK: AC_PAYLOAD_TYPE_LIST = 16385;
#[doc = "< Chunk data only; image data may be present as chunk"]
pub const AC_PAYLOAD_TYPE_LIST_AC_PAYLOAD_TYPE_CHUNKDATA: AC_PAYLOAD_TYPE_LIST = 4;
#[doc = "< Compressed image data only"]
pub const AC_PAYLOAD_TYPE_LIST_AC_PAYLOAD_TYPE_COMPRESSED_IMAGE: AC_PAYLOAD_TYPE_LIST = 1001;
#[doc = "< Compressed image data extended with chunk data"]
pub const AC_PAYLOAD_TYPE_LIST_AC_PAYLOAD_TYPE_COMPRESSED_IMAGE_EXTENDED_CHUNK:
    AC_PAYLOAD_TYPE_LIST = 1002;
#[doc = " @enum AC_PAYLOAD_TYPE_LIST\n\n This enum represents the different payload types of a buffer.\n\n @warning\n  - Use AC_PAYLOAD_TYPE integer values in place of AC_PAYLOAD_LIST enum\n    values"]
pub type AC_PAYLOAD_TYPE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_PAYLOAD_TYPE;\n\n Integer representation of the payload type enum (AC_PAYLOAD_TYPE_LIST)."]
pub type AC_PAYLOAD_TYPE = i32;
#[doc = "< Unknown pixel endianness"]
pub const AC_PIXEL_ENDIANNESS_LIST_AC_PIXEL_ENDIANNESS_UNKNOWN: AC_PIXEL_ENDIANNESS_LIST = 0;
#[doc = "< Little endian"]
pub const AC_PIXEL_ENDIANNESS_LIST_AC_PIXEL_ENDIANNESS_LITTLE: AC_PIXEL_ENDIANNESS_LIST = 1;
#[doc = "< Big endian"]
pub const AC_PIXEL_ENDIANNESS_LIST_AC_PIXEL_ENDIANNESS_BIG: AC_PIXEL_ENDIANNESS_LIST = 2;
#[doc = " @enum AC_PIXEL_ENDIANNESS_LIST\n\n This enum represents the different pixel endiannesses.\n\n @warning\n  - Use AC_PIXEL_ENDIANNESS integer values in place of\n    AC_PIXEL_ENDIANNESS_LIST enum values"]
pub type AC_PIXEL_ENDIANNESS_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_PIXEL_ENDIANNESS;\n\n Integer representation of the pixel endianness enum\n (AC_PIXEL_ENDIANNESS_LIST)."]
pub type AC_PIXEL_ENDIANNESS = i32;
#[doc = "< Algorithm that averages nearest neighbours (faster)"]
pub const AC_BAYER_ALGORITHM_LIST_AC_BAYER_ALGORITHM_DIRECTIONAL_INTERPOLATION:
    AC_BAYER_ALGORITHM_LIST = 0;
#[doc = "< Adaptive algorithm that uses directional data (slower, more accurate coloring)"]
pub const AC_BAYER_ALGORITHM_LIST_AC_BAYER_ALGORITHM_ADAPTIVE_HOMOGENEITY_DIRECTED:
    AC_BAYER_ALGORITHM_LIST = 1;
#[doc = "< Undefined algorithm"]
pub const AC_BAYER_ALGORITHM_LIST_AC_BAYER_ALGORITHM_UNKNOWN: AC_BAYER_ALGORITHM_LIST = 2;
#[doc = " @enum AC_BAYER_ALGORITHM_LIST\n\n This enum represents the different algorithms available to interpolate bayer\n image data.\n\n @warning\n  - Use AC_BAYER_ALGORITHM integer values in place of AC_BAYER_ALGORITHM_LIST\n    enum values"]
pub type AC_BAYER_ALGORITHM_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_BAYER_ALGORITHM;\n\n Integer representation of the bayer algorithm enum\n (AC_BAYER_ALGORITHM_LIST)."]
pub type AC_BAYER_ALGORITHM = i32;
#[doc = "< Default behavior for the underlying transport layer"]
pub const AC_START_STREAM_FLAGS_LIST_AC_START_STREAM_FLAG_DEFAULT: AC_START_STREAM_FLAGS_LIST = 1;
#[doc = "< Will try to start Gvsp 2.0 stream with 16bit block id if supported"]
pub const AC_START_STREAM_FLAGS_LIST_AC_START_STREAM_FLAG_GVSP_LEGACY: AC_START_STREAM_FLAGS_LIST =
    1001;
#[doc = " @enum AC_START_STREAM_FLAGS_LIST\n\n This enum represents the transport layer flags for starting a stream."]
pub type AC_START_STREAM_FLAGS_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_START_STREAM_FLAGS;\n\n Integer representation of the start stream flags\n (AC_START_STREAM_FLAGS_LIST)."]
pub type AC_START_STREAM_FLAGS = i32;
#[doc = "< Default open mode (out | trunc)"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_DEFAULT:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 0;
#[doc = "< Open for output operations"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_OUT:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 1;
#[doc = "< Open in binary mode"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_BINARY:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 2;
#[doc = "< Truncate file if it exists"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_TRUNC:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 4;
#[doc = "< Append mode"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_APPEND:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 8;
#[doc = "< Open and seek to end immediately"]
pub const AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST_AC_O_DEV_FILE_STREAM_OPEN_MODE_ATE:
    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = 16;
#[doc = " @enum AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST\n\n This enum represents the open mode flags for the output device file stream.\n\n @warning\n  - Use AC_O_DEV_FILE_STREAM_OPEN_MODE integer values in place of\n    AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST enum values"]
pub type AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST = ::std::os::raw::c_uint;
#[doc = " @typedef AC_O_DEV_FILE_STREAM_OPEN_MODE;\n\n Integer representation of the open mode flags enum\n (AC_O_DEV_FILE_STREAM_OPEN_MODE_LIST)."]
pub type AC_O_DEV_FILE_STREAM_OPEN_MODE = i32;
pub type wchar_t = ::std::os::raw::c_int;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
